Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/admin/depts/regjeringen.no/lahkaasahus-sami-vuooskuvlaoahpaheaddjeoahpuid-1-7-dasi-ja-5-10-dasi-rammaplanii_id_594360.html.tmx
Source language: sme
Languages: nob

source: Láhkaásahus sámi vuođđoskuvlaoahpaheaddjeoahpuid 1.-7. dási ja 5.-10. dási rámmaplánii
nob: Forskrift om rammeplan for de samiske grunnskolelærerutdanningene for 1.–7. trinn og 5.–10. trinn

source: Máhttodepartemeanta mearridan njukčamánu 1. b. 2010 láhkavuođu vuođul lágas Lov om universiteter og høyskoler av 1. april 2005 nr 15 § 3-2 annet ledd ( Láhka universitehtaid ja allaskuvllaid várás njukčamánu 1. b. 2005 nr. 15 § 3-2 nubbi lađas ) .
nob: Fastsatt av Kunnskapsdepartementet 1. mars 2010 med hjemmel i lov om universiteter og høyskoler av 1. april 2005 nr. 15 § 3-2 annet ledd .

source: § 1 DOAIBMAVIIDODAT JA ULBMIL
nob: § 1 VIRKEOMRÅDE OG FORMÅL

source: Láhkaásahus gusto universitehtaide ja allaskuvllaide mat addet sámi vuođđoskuvlaoahpaheaddjeoahpu ja leat akkrediterejuvvon čuovvovaš lága vuođul : Láhka universitehtaid ja allaskuvllaid várás § 1-2 ja § 3-1 .
nob: Forskriften gjelder for universiteter og høyskoler som gir samisk grunnskolelærerutdanning , og som er akkreditert etter lov om universiteter og høyskoler § 1-2 og § 3-1 .

source: Láhkaásahus gusto 4-jagáš sámi vuođđoskuvlaoahpaheaddjeohppui .
nob: Forskriften gjelder for 4-årig samisk grunnskolelærerutdanning .

source: Láhkaásahus meroštallá sámi vuođđoskuvlaoahpaheaddjeoahpuid 1.-7. dási ja 5.-10. dási rámmaid .
nob: Forskriften definerer rammene for de samiske grunnskolelærerutdanningene for 1.–7. trinn og 5.–10. trinn .

source: Sámi vuođđoskuvlaoahpaheaddjeoahppu lea ovttaárvosaš našunála vuođđoskuvlaoahpaheaddjeoahpuin .
nob: Den samiske grunnskolelærerutdanningen er likeverdig med den norske grunnskolelærerutdanningen .

source: Sámi vuođđoskuvlaoahpaheaddjeoahpu váldooahpahusgiellan lea sámegiella .
nob: Samisk grunnskolelærerutdanning skal ha samisk som hovedundervisningsspråk .

source: Sámi vuođđoskuvlaoahpaheaddjioahpu vuođđudussan leat sámi kultuvra ja servodat ja sámi oahppanáddejumit ja oahpahusvuogit leat vuolggasadjin .
nob: Samisk grunnskolelærerutdanning er forankret i samisk kultur og samfunn og har samiske læringsforståelser og undervisningsmåter som sitt utgangspunkt .

source: Sámi vuođđoskuvlaoahpaheaddjeoahppu addá máŋggabealat máhtu sámi dilálašvuođain .
nob: Den samiske grunnskolelærerutdanningen gir allsidig kjennskap til samiske forhold .

source: Láhkaásahusa ulbmil lea dárkkistit ahte oahppoásahusat fállet integrerejuvvon , profešuvdnii ráhkkanahtti ja dutkanvuđđosaš sámi vuođđoskuvlaoahpaheaddjeoahpuid main lea alla kvalitehta .
nob: Forskriftens formål er å sikre at institusjonene tilbyr integrerte , profesjonsrettete og forskningsbaserte samiske grunnskolelærerutdanninger med høy faglig kvalitet .

source: Oahput galget čuovvut oahpahuslága ja vuođđooahpahussii gustovaš oahppoplánaid .
nob: Utdanningene skal forholde seg til opplæringsloven og gjeldende læreplanverk for grunnopplæringen .

source: Oahppoásahusat galget lágidit integrerejuvvon vuođđoskuvlaoahpaheaddjeoahpuid , main lea ollisvuohta ja oktiigullevašvuohta teoriija- ja praksisoahpuid gaskkas , fágaid ja fágadidáktihka gaskkas ja fágaid gaskkas .
nob: Institusjonene skal legge til rette for integrerte grunnskolelærerutdanninger med helhet og sammenheng mellom teori- og praksisstudier , mellom fag og fagdidaktikk og mellom fag .

source: Vuođđoskuvlaoahpaheaddjeoahput galget kandidáhtaide addit nana fágalaš ja didáktalaš máhtuid , gealbudahttit sin atnit ávkin dutkama oahpaheaddjeámmáhis ja ámmátlaš ovdáneamis jeavddalaččat .
nob: Grunnskolelærerutdanningene skal gi kandidatene solide faglige og didaktiske kunnskaper , kvalifisere for forskningsbasert yrkesutøvelse og for kontinuerlig profesjonell utvikling .

source: Oahpuid iešvuohta lea lagas ovttasdoaibman profešuvdnasurggiiguin ja dainna servodagain mas skuvla lea oassin .
nob: Utdanningene skal kjennetegnes av et nært samspill med profesjonsfeltet og det samfunnet skolen er en del av .

source: Oahput galget čatnat oahpaheaddjeámmáha historjjálaš ja servodatlaš oktavuhtii . Oahput galget maiddái oahpahit kritihkalaččat reflekteret ja hukset profešuvdnaáddejumi .
nob: Utdanningene skal sette læreryrket inn i en historisk og samfunnsmessig sammenheng og bidra til kritisk refleksjon og profesjonsforståelse .

source: Sámi vuođđoskuvlaoahpaheaddjeoahppu galgá čatnat oahpaheaddjeámmáha sámi oktavuhtii ja álgoálbmotoktavuhtii .
nob: Samisk grunnskolelærerutdanning skal sette læreryrket inn i en samisk kontekst og urfolkskontekst .

source: Vuođđoskuvlaoahpaheaddjeoahput gealbudahttet kandidáhtaid bastit oahpahit sámi dilálašvuođaid birra ja sii galget diehtit ja dovdat sámi mánáid vuoigatvuođaid oahpahuslága mielde ja vuođđooahpahussii gustovaš oahppoplánaid vuođul .
nob: Grunnskolelærerutdanningene skal kvalifisere kandidatene til å ivareta opplæring om samiske forhold og ha kunnskap om samiske barns rett til opplæring i tråd med opplæringsloven og gjeldende læreplanverk for grunnopplæringen .

source: § 2 OAHPPANJOKSOSAT
nob: § 2 LÆRINGSUTBYTTE

source: Sámi vuođđoskuvlaoahpaheaddjeoahput gealbudahttet oahpaheddjiid bargagoahtit ja čađahit hástaleaddji ja máŋggabealat ámmáha girjás ja rievdi servodagas .
nob: De samiske grunnskolelærerutdanningene skal kvalifisere lærere til å utøve et krevende og komplekst yrke i et samfunn som preges av mangfold og endring .

source: Oahppanjoksosat leat hábmejuvvon našunála kvalifiserenrámmaid vuođul .
nob: Læringsutbytte er formulert med utgangspunkt i nasjonalt kvalifikasjonsrammeverk .

source: Go kandidáhttá lea ollašuhttán vuođđoskuvlaoahpaheaddjeoahpu , de son galgá leat olahan oahppanjoksosiid mat čilgejuvvojit máhtu , gálggaid ja oppalaš gelbbolašvuođa vuođul .
nob: Kandidaten skal etter fullført grunnskolelærerutdanning ha følgende læringsutbytte definert som kunnskap , ferdigheter og generell kompetanse , som fundament for arbeid i skolen og videre kompetanseutvikling .

source: Oahppanjoksosat erenoamážit 1 . – 7. dási kandidáhtaide :
nob: Læringsutbytte særskilt for kandidater 1.–7. trinn :

source: Kandidáhtas - lea fágalaš ja fágadidáktalaš máhttu sámegielas , matematihkas , dárogielas ja eará oahppofagain , ja nana máhttu álgooahpahusas nuoramus ohppiide lohkan- , čállin- ja rehkenastinfágain - lea máhttu bargat ohppiid vuođđogálggaiguin das ahte ovdanbuktit njálmmálaččat , lohkat , ovdanbuktit čálalaččat , rehkenastit ja geavahit digitála reaidduid fágaid siskkobealde ja fágaid rastá - lea máhttu lágidit oahpahusa mii ovdánahttá vuođđogálggaid heivehuvvon 1 .
nob: Kandidaten - har faglige og fagdidaktiske kunnskaper i samisk , matematikk , norsk og øvrige fag som inngår i utdanningen , og solid kunnskap om begynneropplæring for de yngste elevene i fagene og lesing , skriving og regning - har kunnskap om arbeid med elevenes grunnleggende ferdigheter i å uttrykke seg muntlig , lese , uttrykke seg skriftlig , regne og bruke digitale verktøy i og på tvers av fag

source: -7. dási ohppiide - lea máhttu ollislaš oahppomannolagas , mas deattuhit sirdášumi mánáidgárddis skuvlii ja mánáidskuvladásis nuoraidskuvladássái
nob: - har kunnskap om det helhetlige opplæringsløpet , med vekt på overgangen fra barnehage til skole og barnetrinn til ungdomstrinn

source: Oahppanjoksosat erenoamážit 5 . – 10. dási kandidáhtaide :
nob: Læringsutbytte særskilt for kandidater 5.–10. trinn :

source: Kandidáhtas - lea nana fágalaš ja fágadidáktalaš máhttu sámegielas ja eará oahppofágain ja máhttu fágaide skuvlafágan ja dutkanfágan - lea máhttu bargat ohppiid vuođđogálggaid ovdánahttimiin das ahte ovdanbuktit njálmmálaččat , lohkat , ovdanbuktit čálalaččat , rehkenastit ja geavahit digitála reaidduid fágaid siskkobealde ja fágaid rastá - lea máhttu lágidit oahpahusa mii ovdánahttá vuođđogálggaid heivehuvvon 5 .
nob: - har solide faglige og fagdidaktiske kunnskaper i samisk og de øvrige fagene som inngår i utdanningen og kunnskap om fagene som skolefag og forskningsfag - har kunnskap om arbeid med videreutvikling av elevenes grunnleggende ferdigheter i å uttrykke seg muntlig , lese , uttrykke seg skriftlig , regne og bruke digitale verktøy i og på tvers av fag

source: -10. dási ohppiide - lea máhttu ollislaš oahppomannolagas , mas deattuhit sirdášumi mánáidskuvladásis nuoraidskuvladássái ja nuoraidskuvladásis joatkkaskuvlaoahpu dássái
nob: - kan tilrettelegge for progresjon i de grunnleggende ferdighetene i opplæringen tilpasset elever på 5.–10. trinn - har kunnskap om det helhetlige opplæringsløpet , med vekt på overgangen fra barnetrinn til ungdomstrinn og ungdomstrinn til videregående opplæring

source: Oktasaš oahppanjoksosat goappaš oahpuid kandidáhtaide : Dán guovtti vuođđoskuvlaoahpaheaddjeoahpu oahppanjoksosat biddjojit fágaid sisdoalu ja bargovugiid oktavuhtii .
nob: Felles læringsutbytte for kandidater i begge utdanningsløp : Læringsutbytte må ses i sammenheng med fagenes innhold og arbeidsmåter i de to grunnskolelærerutdanningene .

source: MÁHTTU Kandidáhtas - lea máhttu skuvlla ja oahpaheaddjeámmáha iešvuođas , historjjás , ovdáneamis ja sajádagas sámi servodagas ja servodagas muđui - lea máhttu láhkavuođu birra , nu movt skuvlla ulbmila , árvovuođu , oahppoplánaid ja ohppiid iešguđetlágan vuoigatvuođaid birra - lea máhttu oahppoplánabargguin ja skuvllas organisašuvdnan - lea máhttu mánáid ja nuoraid oahppamis , ovdáneamis ja ahtanuššamis iešguđetlágan sosiála , máŋggakultuvrralaš ja máŋggagielalaš konteavsttain - lea máhttu luohkkájođiheamis ja luohkkábirrasis ja máhttá ovdánahttit buriid oktavuođaid ohppiiguin ja ohppiid gaskkas - lea máhttu áddet man mávssolaš ja eaktudahtti buorre gulahallan lea ja buorre ovttasbargu skuvlla ja ruovttuid gaskkas - lea máhttu máŋggalágan bargovugiin , oahppanresurssain ja oahppanarenain ja áddet mihttomeriid , sisdoalu , bargovugiid , árvvoštallama ja ovttaskas ohppiid eavttuid oktiigullevašvuođa - lea máhttu mánáid ja nuoraid bajásšaddanbirrasa , dásseárvvu ja identitehtabarggu birra - lea máhttu mánáin , geat leat váttis diliin ja mánáid vuoigatvuođain našunála ja riikkaidgaskasaš perspektiivvas , riikkaidgaskasaš šiehtadusaid vuođul , álgoálbmotjulggaštusaid ja našunála lágaid vuođul - lea máhttu sámi , našunála ja riikkaidgaskasaš dutkan- ja ovddidanbargguin mat gusket oahpaheaddjeámmáhii - lea máhttu sámi árbevirolaš máhtus iešguđetge fágasurggiid siskkobealde - lea máhttu sámi mánáid ja nuoraid bajásšaddandilálašvuođaid hástalusain
nob: - har kunnskap om skolens og lærerprofesjonens egenart , historie , utvikling og plass i det samiske samfunnet og samfunnet forøvrig

source: OPPALAŠ GELBBOLAŠVUOHTA Kandidáhtta - bastá oaččuhit ámmátlaš oahpaheaddjesearvevuođa nu , ahte ovdánahttá buori geavada ja ámmátetihkalaš vuođđudusa - bastá oaččuhit ámmátlaš searvevuođa sámi oahpaheddjiid gaskii dainna ulbmiliin ahte ovdánahttit buori geavada ja ámmátetihkalaš vuođđudusa maiddái riikarájiid rastá - bastá ovdánahttit demokratiijaáddejumi , demokráhtalaš oassálastima ja bastá kritihkalaččat reflekteret luohkkádásiid dárbbuid sierra - bastá nannet riikkaidgaskasaš ja máŋggakultuvrralaš áššiid skuvlla barggus ja bastá oaččuhit áddejumi sámiid álgoálbmotstáhtosa hárrái - bastá fuobmát iežas oahppan- ja gelbbolašvuođadárbbuid oahpaheaddjeámmáhis - lea háhkan nuppástuhttin- ja ovddidangelbbolašvuođa , mainna bastá dustet skuvlla boahttevuođas - bastá nannet sámi , álgoálbmot ja riikkaidgaskasaš áššiid skuvlla barggus - bastá doarjut sámi mánáid ja nuoraid ovdáneami ja identitehtahuksema
nob: - har kunnskap om lovgrunnlag , herunder skolens formål , verdigrunnlag , læreplaner og elevers ulike rettigheter

source: § 3 MOATTESUORAT Vuođđoskuvlaoahpaheaddjeoahpu STRUKTUVRA
nob: - har kunnskap om læreplanarbeid og om skolen som organisasjon

source: ( 1 ) Spesialiserema ja fágalaš ovttasteami gáibádusat Vuođđoskuvlaoahpaheaddjeoahput leat spesialiserejuvvon skuvlla ahkeluohkáide , ja gealbudahttet oahpahit jogo 1.–7. dásis dahje 5.–10. dásis .
nob: - har kunnskap om barns og unges læring , utvikling og danning i ulike sosiale , flerkulturelle og flerspråklige kontekster - har kunnskap om klasseledelse og klassemiljø og om utvikling av gode relasjoner til og mellom elever

source: Oahput organiserejuvvojit guovtti sierra vuođđoskuvlaoahpaheaddjeoahppun vugiiguin , mat sihkkarastet progrešuvnna ollislaš profešuvdnaoahpus .
nob: - har kunnskap om viktigheten av og forutsetninger for god kommunikasjon og godt samarbeid mellom skole og hjem

source: 1.–7. dási vuođđoskuvlaoahpaheaddjeoahppu doallá sisttis dábálaččat unnimusat njeallje oahpahusfága , main unnimusat okta fága lea 60 oahppočuoggá ja eará fágat leat unnimusat 30 oahppočuoggá .
nob: - har kunnskap om et bredt repertoar av arbeidsmåter , læringsressurser og læringsarenaer og om sammenhengen mellom mål , innhold , arbeidsmåter , vurdering og de enkelte elevenes forutsetninger

source: Okta oahpahusfága 4. oahppojagis sáhttá buhttet ovtta 30 oahppočuoggá skuvlarelevánta fága .
nob: - har kunnskap om barns og unges oppvekstmiljø , likestilling og identitetsarbeid

source: Jus joatká masteroahpuin 3. oahppojagi maŋŋá , de masteroahpu vuosttaš jahki buhtte vuođđoskuvlaoahpaheaddjeoahpu 4. oahppojagi fágaid .
nob: - har kunnskap om barn i vanskelige situasjoner og om barns rettigheter i et nasjonalt og internasjonalt perspektiv , på grunnlag av internasjonale konvensjoner , urfolkserklæringer og nasjonale lover

source: 5.-10. dási vuođđoskuvlaoahpaheaddjeoahppu doallá sisttis dábálaččat golbma oahpahusfága , juohke fága lea 60 oahppočuoggá .
nob: - har kunnskap om samisk , nasjonalt og internasjonalt forsknings- og utviklingsarbeid med relevans for lærerprofesjonen

source: Ovtta oahpahusfága 4. oahppojagis sáhttá buhttet ovttain oahpahusfágain ja ovttain skuvlarelevánta fágain , main goappásge leat 30 oahppočuoggá , nubbi vejolašvuohta lea guokte oahpahusfága , main goappásge leat 30 oahppočuoggá .
nob: - kan selvstendig og i samarbeid med andre planlegge , gjennomføre og reflektere over undervisning i og på tvers av fag , med utgangspunkt i samisk tradisjonell kunnskap , samt forsknings- og erfaringsbasert kunnskap

source: Geatnegahtton fágat , fágaid ja hárjehallanoahpahusa viidodat Goappaš oahpuin galgá hárjehallanoahppu doallat sisttis bagadallama , árvvoštallama ja iešguđetlágan hárjehallanoahpu buot oahppojagiin .
nob: - kan tilpasse opplæringen til elevers ulike evner og anlegg , interesser og sosiokulturelle bakgrunn , motivere til lærelyst gjennom å tydeliggjøre læringsmål og bruke varierte arbeidsmåter for at elevene skal nå målene

source: Hárjehallanoahppu lea integrerejuvvon oassin buot oahppofágain .
nob: - kan vurdere og dokumentere elevers læring og utvikling i forhold til opplæringens mål , gi læringsfremmende tilbakemeldinger og bidra til at elever kan vurdere egen læring

source: Hárjehallanoahpu viidodat lea unnimusat 100 beaivvi njealji jagis ; unnimusat 80 beaivvi golmma vuosttaš oahppojagi , ja unnimusat 20 beaivvi maŋemus oahppojagi .
nob: - forstår de samfunnsmessige perspektivene knyttet til teknologi- og medieutviklingen ( trygg bruk , personvern , ytringsfrihet ) og kan bidra til at barn og unge utvikler et reflektert forhold til digitale arenaer

source: Hárjehallanoahppu čađahuvvo vuođđoskuvllas ja juhkkojuvvo sihke vuolit ja alit ahkeluohkáide dan oahpposuorggis , masa oahppu gealbudahttá .
nob: - kan kritisk reflektere over egen og skolens praksis i arbeidet med videreutvikling av lærerrollen og profesjonsetiske spørsmål

source: Hárjehallanoahpus galgá leat progrešuvdna ja heivehuvvot studeanttaid válljenfágaide buot oahppojagiin ja čadnojuvvot iešguđetlágan skuvladoaimmaide .
nob: - kan mestre samisk muntlig og skriftlig , vise kompetent språkbruk i profesjonssammenhenger og kunne undervise på samisk i sine fag .

source: Hárjehallanoahpu lágideapmi berre speadjalastit miehtásámi perspektiivvaid .
nob: Mestrer norsk muntlig og skriftlig og kan bruke språket på en kvalifisert måte i profesjonssammenheng

source: Oahpahusfágat galget leat profešuvdnii ráhkkanahtti oahpaheaddjeoahppofágat ja dain galgá leat fágadidaktihkka ja galgá bargojuvvot vuođđogálggaiguin fágas .
nob: - kan vurdere og bruke relevante forskningsresultater og selv gjennomføre systematisk utviklingsarbeid

source: Oahpahusfágain , skuvlarelevánta fágain ja fáddájoavkkuin galgá dutkan leat vuođđun ja čanastuvvot dutkanaktiivvalaš fágabirrasii .
nob: - kan i samarbeid med foresatte og faglige instanser identifisere behov hos elevene og iverksette nødvendige tiltak

source: Bachelorbargu lea geatnegahtton 3. oahppojagi . Barggu viidodat ja dieđateoriija ja metodaid vuođđomáhttu lea oassin 15 oahppočuoggá pedagogihka ja oahppimáhtu oahppoollisvuođas .
nob: - kan legge til rette for utvikling av kompetanse i entreprenørskap og for at lokalt arbeids- , samfunns- og kulturliv , tradisjonsbærere og ressurspersoner involveres i opplæringen

source: Bachelorbargu galgá ráhkkanahttit profešuvdnii ja temáhtalaččat čatnasit pedagogihkkii ja oahppimáhttui ja/dahje eará fágaide .
nob: - har god forståelse for globale spørsmål og bærekraftig utvikling - kan gjøre nytte av samiske læringsmåter i opplæringen

source: Barggus berre leat sámi perspektiiva dahje álgoálbmotperspektiiva .
nob: - kan tilpasse opplæringen i et to- eller flerspråklig perspektiv

source: Vuođđoskuvlaoahpaheaddjeoahpu 1.–7. dásis leat geatnegahtton fágan pedagogihkka ja oahppimáhttu 60 oahppočuoggá , matematihkka 30 oahppočuoggá , sámegiella 30 oahppočuoggá ja dárogiella 30 oahppočuoggá .
nob: - kan bidra til profesjonelt lærerfelleskap med tanke på videreutvikling av god praksis og yrkesetisk plattform - kan bidra til profesjonelt fellesskap mellom samiske lærere med tanke på videreutvikling av god praksis og yrkesetisk plattform også på tvers av landegrensene

source: Vuođđoskuvlaoahpaheaddjeoahpu 5.–10. dásis leat geatnegahtton fágan pedagogihkka ja oahppimáhttu 60 oahppočuoggá .
nob: - kan stimulere til demokratiforståelse , demokratisk deltakelse og evne til kritisk refleksjon tilpasset aktuelle klassetrinn

source: Oahppoásahusat galget lágidit vejolašvuođa váldit riikkaidgaskasaš lohkanbaji ja oahppat riikkaidgaskasaš perspektiivvaid vuođđoskuvlaoahpaheaddjeoahpuin .
nob: - kan bidra til å styrke internasjonale og flerkulturelle dimensjoner ved skolens arbeid og bidra til forståelse for samenes status som urfolk

source: ( 2 ) Oahpuid lágideapmi Vuođđoskuvlaoahpaheaddjeoahpu 1.–7. dássi : 1.–3. oahppojahki : Hárjehallanoahppu Pedagogihkka ja oahppimáhttu 60 oahppočuoggá Sámegiella 30 oahppočuoggá Dárogiella 30 oahppočuoggá Matematihkka 30 oahppočuoggá Oahpahusfága 30 oahppočuoggá
nob: § 3 STRUKTUR FOR DIFFERENSIERT Grunnskolelærerutdanning ( 1 ) Krav til spesialisering og faglig sammensetning Grunnskolelærerutdanningene skal være spesialiserte mot årstrinn i skolen , og kvalifisere for undervisning på henholdsvis 1.–7. trinn og 5.–10. trinn .

source: 4. oahppojahki : Hárjehallanoahppu Oahpahusfága 60 oahppočuoggá , vejolaččat guokte fága goabbáge 30 oahppočuoggá , mas nubbi sáhttá leat skuvlarelevánta fága 30 oahppočuoggá
nob: Grunnskolelærerutdanning for 1.–7. trinn skal normalt omfatte minimum fire undervisningsfag , der minst ett av fagene skal være på 60 studiepoeng og de andre fagene må være på minimum 30 studiepoeng .

source: Vuođđoskuvlaoahpaheaddjeoahpu 5.–10. dássi : 1.–3. oahppojahki : Hárjehallanoahppu Pedagogihkka ja oahppimáhttu 60 oahppočuoggá ( dábálaš juohkin lea 15 oahppočuoggá goabbáige dan guovtti vuosttaš oahppojahkái ja goalmmát oahppojahkái 30 oahppočuoggá ) Oahpahusfága I 60 oahppočuoggá Oahpahusfága II 60 oahppočuoggá
nob: Ved overgang til masterutdanning etter 3. studieår vil det første året i masterutdanningen erstatte fag i det 4. studieåret i grunnskolelærerutdanningen . Grunnskolelærerutdanning for 5.–10. trinn skal normalt omfatte tre undervisningsfag , hvert på 60 studiepoeng .

source: 4. oahppojahki : Hárjehallanoahppu Oahpahusfága III 60 oahppočuoggá , vejolaččat guokte fága goabbáge 30 oahppočuoggá , mas nubbi sáhttá leat skuvlarelevánta fága 30 oahppočuoggá
nob: Et undervisningsfag i 4. studieår kan erstattes av ett undervisningsfag og ett skolerelevant fag hver på 30 studiepoeng , eventuelt to undervisningsfag hver på 30 studie-poeng .

source: § 4 NAŠUNÁLA NJUOLGGADUSAT , PROGRÁMMAPLÁNAT JA INDIKÁHTORAT
nob: Ved overgang til masterutdanning etter 3. studieår vil det første året i masterutdanningen erstatte fag i 4. studieåret i grunnskolelærerutdanningen .

source: Vuođđoskuvlaoahpaheaddjeoahpuide ráhkaduvvojit našunála njuolggadusat fágaide ja indikáhtorat mat meroštallet vuođđoskuvlaoahpaheaddjeoahpuid , main lea alla kvalitehta .
nob: Obligatoriske fag , fagenes og praksisopplæringens omfang I begge utdanningene skal det være veiledet , vurdert og variert praksisopplæring i alle studie-årene .

source: Láhkaásahusa , našunála ja sámi njuolggadusaid vuođul , galget oahppoásahusat ráhkadit sámi vuođđoskuvlaoahpaheaddjeoahpuid prográmmaplánaid .
nob: Omfanget av praksisopplæringen skal være minst 100 dager fordelt over fire år ; minimum 80 dager i løpet av de tre første studieårene , og minimum 20 dager i løpet av det siste studieåret .

source: Prográmmaplánat mearridit fágalaš sisdoalu , hárjehallanoahpu , organiserema , bargovugiid ja árvvoštallanortnegiid .
nob: Praksisopplæringen skal være i grunnskolen og fordeles på både lavere og høyere årstrinn i det løpet som utdanningen kvalifiserer for .

source: Eksámen dahje geahččaleapmi , mii ii leat čađahuvvon vuođđoskuvlaoahpaheaddjeoahpu oassin , sáhttá leat vuođđun friddjet eksámenis , geahča universitehtaid ja allaskuvlalága § 3-5 .
nob: Det skal være progresjon i praksisopplæringen , og den skal være tilpasset studentenes fagvalg i alle studieårene og knyttet til ulike deler av skolens virksomhet .

source: Oahppu mii sáhttá addit vuođu friddjet eksámenis , galgá leat jogo fága , mii vástida skuvlafága dahje fága mas lea relevánsa vuođđoskuvlla oahpaheaddjebargui , geahča § 1 , ja berre fátmmastit fágadidaktihka ja hárjehallanoahpu .
nob: Praksisopplæringen bør tilrettelegges slik at det gjenspeiler et allsamisk perspektiv . Alle undervisningsfag skal være profesjonsrettede lærerutdanningsfag og omfatte fagdidaktikk og arbeid med grunnleggende ferdigheter i faget .

source: Studeanta berre maid duođaštit sámegiela gelbbolašvuođa fágas .
nob: Bacheloroppgave i det 3. studieåret er obligatorisk .

source: Vuođđoskuvlaoahpaheaddjeoahpu 1.–7. dásis sáhttá friddjet nuppi dain dárogiela čállingiela ( girjedárogiela ja ođđadárogiela ) geahččaleamis daid studeanttaid , geaidda ii leat addojuvvon árvvoštallan dárogiela goappaš čállingielain joatkkaskuvlaoahpus .
nob: Arbeidet med oppgaven og innføring i vitenskapsteori og metode skal utgjøre 15 studiepoeng av pedagogikk og elevkunnskap . Oppgaven skal være profesjonsrettet med tematisk forankring i pedagogikk og elevkunnskap og / eller i andre fag .

source: Dárogiela gáibádusas sáhttá friddjet daid olgoriikastudeanttaid , geat válljejit eatnigiela oassin iežaset oahpus .
nob: Oppgaven bør ha et samisk perspektiv eller urfolksperspektiv .

source: Friddjet geahččaleamis , nuppi dain dárogiela čállingielain , gusto maiddái vuođđoskuvlaoahpaheaddjeoahpu 5.–10. dási studeanttaide , geat eai vállje dárogiela fágačoakkáhussii .
nob: For grunnskolelærerutdanning 1.–7. trinn er det obligatorisk med pedagogikk og elevkunnskap 60 studiepoeng , matematikk 30 studiepoeng , samisk 30 studiepoeng og norsk 30 studiepoeng .

source: Studeanttaide , geain dárogiella lea 5.–10. dási vuođđoskuvlaoahpaheaddjeoahpus , eai gusto friddjenmearrádusat goappáge dárogiela čállingiela geahččaleamis .
nob: For grunnskolelærerutdanning 5.–10. trinn er det obligatorisk med pedagogikk og elevkunnskap 60 studiepoeng . Ingen undervisningsfag er obligatoriske .
